[Killed] BlockStatement
src/Roller.ts:11:25
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
     constructor(faces: number) {
-        if (faces >= 2) {
-            this._faces = faces;
-        } else {
+        if (faces >= 2) {} else {
             this._faces = 6;
         }
killedBy: Roller constructor should set the number of faces to the provided value if it is valid
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 8
Received: undefined

[Killed] ConditionalExpression
src/Roller.ts:17:25
             this._faces = 6;
         }
         this._distribution = new Map<number, number>();
-        for (let i = 1; i <= this._faces; i++) {
+        for (let i = 1; false; i++) {
             this._distribution.set(i, 0);
         }
killedBy: Roller roll should update the distribution for the value rolled
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: undefined

[Killed] EqualityOperator
src/Roller.ts:35:26
     private lastRoll: number = 0;
 
     roll(value: number): number {
-        if (value < 1 || value > this._faces) {
+        if (value < 1 || value <= this._faces) {
             return 0;
         }
killedBy: Roller roll should return 0 if the value provided is not valid for the number of faces
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 5

[Killed] ConditionalExpression
src/Roller.ts:35:13
     private lastRoll: number = 0;
 
     roll(value: number): number {
-        if (value < 1 || value > this._faces) {
+        if (true) {
             return 0;
         }
killedBy: Roller roll should return the value provided if it is valid for the number of faces
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 3
Received: 0
